[{"Review_Date":"17 June 2019","Author":"HotToastyRag","Rating":"10","Review_Title":" There's nothing like the first\n","Review":"There's nothing like the first in a series, is there? The introduction to the characters, the immersion into the fictional world, the first time you laugh, cry, care, and fear for someone's safety can never be repeated. No matter how many Harry Potter movies they crank out, or if they ever remake them in the future, none will come close to the wonderful first film, Harry Potter and the Sorcerer's Stone.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"23 March 2018","Author":"Keyan-the-Eagle144","Rating":"8","Review_Title":" The major start of all the magic!\n","Review":"Having read the first few Harry Potter books before 2001 and hearing about the hype for the first movie, I was excited. I heard there was going to be an all-British cast (which makes sense, right?) and we'd get to see a live version of one of the defining novels of our generation. From what I remember I went with my family and a family friend to see the movie the day after Christmas and was pleasantly amazed. After the movie was over, I watched the credits and discovered some familiar names (the late Alan Rickman, Sister Act's Maggie Smith, James Bond 007's Robbie Coltrane, and Star Wars' Warwick Davis); others not so familiar (the kids, some of whom had their debut). But it was a good movie and was a party of colors and sights for all to see. This is easily my favorite of all the Harry Potter films. The catalyst of the movie series!","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"14 August 2016","Author":"Hollywood_Yoda","Rating":"8","Review_Title":" Better Than Anticipated\n","Review":"Like a lot of others, I refused to watch this film when it was originally released, thinking it was going to be another movie for kids, loosely taken from the source. Was I ever wrong? ","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"21 November 2001","Author":"jhclues","Rating":"10","Review_Title":" The Magic Comes To Life!\n","Review":"Once upon a time (and not that long ago), in the vivid, fertile imagination of author J.K. Rowling, a character was born:  A boy.  A young boy named Harry, who was destined to become one of the most beloved characters to emerge from a work of fiction in a long, long time, and was quickly embraced by young and old alike in all corners of the world.  And now, thanks to the magic of the cinema, Harry and his companions fairly leap from the pages of the novel to the silver screen in the phenomenal motion picture, `Harry Potter and the Sorcerer's Stone,' directed by Chris Columbus and written for the screen by Steve Kloves.  Indeed, Harry Potter is a boy, but not just any boy; because Harry (Daniel Radcliffe) just happens to be a wizard.  But, orphaned as a baby, Harry has been raised by his Aunt Petunia (Fiona Shaw) and Uncle Vernon Dursley (Richard Griffiths), who never let him in on the fact that he was, well-- what he was.  It seems that Petunia didn't approve of her own sister-- Harry's mother-- because she was a witch; nor of Harry's father because he, too, was a wizard.  When Harry turns eleven, however, the secret is out of the bag when-- after some strange goings-on-- a giant of a man named Rubeus Hagrid (Robbie Coltrane) shows up at the Dursley's door to collect Harry and take him off to `Hogwarts,' a school for wizards and witches and all who would perfect the gift with which they were born:  The gift of magic!  And from the moment Harry boards the train (from station platform nine-and-three-quarters) that will take him to his destiny, the magic is alive-- for Harry, and for the audience, as well; and it's a journey you will never forget.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"25 May 2017","Author":"stormhawk2021","Rating":"8","Review_Title":" Epic film\n","Review":"Ah, the first film adaptation of the beloved Harry Potter series. Harry Potter is an 11-year-old boy who comes to find out that he is a wizard. He lives with his uncaring Muggle (non magic) aunt, uncle, and cousin since his parents died when he was a baby. They were murdered by a dark and powerful evil wizard named Lord Voldemort. Harry would be dead too, but was miraculously saved, making him something of a legend. Upon learning of his guarded magic roots, Harry gets enrolled in Hogwarts- a British school for witches and wizards. While there he learns to come into his own, meet people that are actually good to him, and learn more of his dark past. Looking back, I don't know if it was a good idea to have Chris Columbus direct this, as he does have a reputation for being something of a hack, albeit a decent one. I think his direction is okay here. Yeah, retrospectively it could have been better, but it could also have been much worse. At least with him at the helm we get a good amount of whimsy to go along with a bit of menace, and that's a good thing, as the book was likewise not too heavy on the darker stuff (though that sure changed as time went on). Many liberties are taken, which is weird since the book is quite short, and the film is two and a half hours. It does get the point across decently enough though, and also works as a piece for those unfamiliar with the source material. John Williams provides great music, there's wonderful art direction and set design, and there's some nifty set pieces too. Featuring an all-British cast, this film is impeccably cast, and the performances are good too. Finding decent child actors is hard, but they really scored here. My enjoyment of this movie has waned over time, but it's still not a terrible piece of work by any means, so check it out.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"17 December 2004","Author":"AvinashPatalay","Rating":null,"Review_Title":" Alohomora - of the magical world...\n","Review":"I watched this movie first time when I was left with no choice. My expectations were extremely low as I always wondered if Harry Potter books were over-hyped. How-ever after watching the movie it did make me a Harry Potter movie fan. And needless to say - this continues to remain my favourite of HP series. That brings to a point here.... the effect of expectations over a movie. True, expectations reduce joy.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"21 April 2009","Author":"TheLittleSongbird","Rating":"8","Review_Title":" Great fun!\n","Review":"I really liked this film, but I much prefer the book, which has a lot more magic and wonder. Daniel Radcliffe is very likable as Harry, and he is given solid support by a funny Rupert Grint and a good Emma Watson, though she was annoying at times. The scene stealer was definitely Robbie Coltrane; I actually can't imagine anyone else playing Hagrid, Coltrane was just hilarious. Alan Rickman and Maggie Smith were also great, but for me the standout was the late Richard Harris. Now I much prefer Harris's interpretation of Dumbledore. He was soft-spoken, and actually fitted the part better. Both of these qualities were lost in the interpretation that Michael Gambon gave. I am not saying that Michael Gambon was bad, he just wasn't my ideal choice for Harris's replacement. The film is fairly faithful to its source material, and looks very beautiful. However, it is a bit long, and very young children may find Voldemort too frightening. I know because I have triplet brother and sisters who saw it, and couldn't sleep for about a month after viewing. In conclusion, a very good film, well performed and quite dark. 8\/10 Bethany Cox","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"17 September 2016","Author":"miguelneto-74936","Rating":"8","Review_Title":" the beginning of one of the beloved saga the world.\n","Review":"in 2001, in the film Harry Potter and the Sorcerer's Stone, began one of the best sagas of all time, based on the book of the same name by JK Rowling, the film hit full in the cast, all actors are great in their characters, Daniel Radcliffe this impeccable as Harry Potter, the resemblance is too large, Rupert Grint this great as Ron Weasley, Emma excellent Watson as Hermione Granger, Robbie Coltrane as Hagrid, Richard Harris as Dumbledore (which unfortunately from the third movie substituted series, having deceased), Maggie Smith, Alan Rickman great as Snape, Ian Hart, Tom Felton, and etc, all goods, the special effects are great, the picture is great, especially the castles, the soundtrack is very good, and full of great moments, as the final, obvious that the movie has errors, the script has some problems, and the film is very long, I think it was longer than it should, and the film is faithful to the book, even with some missing characters, Harry Potter and the Sorcerer's Stone is a very good film, and marks the beginning of the saga of the Wizard in the movies. Note 8.2","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"20 November 2001","Author":"kylopod","Rating":"7","Review_Title":" Wonderful adaptation, but missing the satire of the book\n","Review":"I enjoyed this movie immensely. But, like \"The Phantom Menace,\" I've had a very hard time viewing it objectively. There was so much anticipation leading up to its release, I simply enjoyed the experience of being there. Having read all four books in the series a few times each, I am overly familiar with the events in the story. As I watched the movie, my continuing thought was \"How well will the next part of the story be translated to the screen?\" rather than \"How entertaining is this film overall?\" I have trouble answering the latter question because I was already entertained by watching a wonderful story dramatized, so I'll never know how I'd have reacted had I seen this movie without having read the books.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"4 July 2018","Author":"AnishMisra","Rating":"8","Review_Title":" Harry Potter and the Philosopher's Stone Review\n","Review":"Harry Potter and the Philosopher's Stone is a film directed by Chris Columbus. For many years, I hadn't given a damn about the Harry Potter series. But seeing the fanfare surrounded by the series, I decided to give it a try. After watching this one, I can definitely say that I am on the verge of being a fan.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"2 January 2007","Author":"aura772","Rating":"10","Review_Title":" ~*-The Magical Journey Begins-*~\n","Review":"When I first saw this movie I was ten years old, the same age the characters where supposed to be. My older cousin and her boyfriend took me to the Mall to watch a movie. Back then I wasn't going very often to the cinema, due to the fact that my parents didn't have time and I wasn't old enough to go alone to any theater. The movie captivated my attention like nothing before and I became so interested in anything that had to do with this movie, and I heard that it was made after a book. I didn't had Internet back then, but I found the first book at a library and convinced my mother to buy it. That's how I became obsessed with reading and writing.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"18 November 2021","Author":"gavin-thelordofthefu-48-460297","Rating":"8","Review_Title":" With spectacular visuals, likeable characters, and a sense of magic and wonder, The Sorcerer's Stone is still a good first entry after 20 years\n","Review":"During my childhood, the earlier Harry Potter books got me into the franchise and especially Fantasy Literature in general. They had thought provoking writing, likeable characters, and compelling world building. Then I saw this movie adaptation of The Sorcerer's Stone (The Philosopher's Stone in the UK) back in theaters and loved it. It's not a perfect film I'll admit, but it's a very good start to a successful fantasy movie franchise.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"3 August 2016","Author":"Leofwine_draca","Rating":"7","Review_Title":" Gem of a children's film and a fine adaptation of the Rowling novel\n","Review":"Over-hyped but still enjoyable \"event\" movie, one of the biggest of 2001 until LORD OF THE RINGS comes out, and a film in which every million of the budget is put up on screen in the special effects. What I found most refreshing about this blockbuster is that the entire cast is made up of British actors and actresses! It makes a change for an expensive blockbuster movie to be thus but there you go, HARRY POTTER is indeed a unique movie. Now I'm not one of those people with lots of time on their hands to read the never-ending Harry Potter books (too busy watching cult movies I'm afraid), but the film has turned out pretty much as I would have expected from the adverts. Although it's overly sentimental (blame it on director Chris Columbus) and aimed at children, adults can still enjoy it for the excellent pacing (rarely does the two-and-a-half hour running time drag) and the plethora of special - and some not so special - effects on view throughout.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"12 November 2001","Author":"scmovieguy","Rating":null,"Review_Title":" Pure cinematic magic\n","Review":"To millions of children of all ages, November 16 has been more eagerly anticipated than Christmas, as the long-awaited film version of J. K. Rowling's beloved novel \"Harry Potter and the Sorceror's Stone\" hits the screen.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"18 December 2001","Author":"Movie-12","Rating":"7","Review_Title":" It's a true adaptation, but lacks an edge like the novel. *** (out of four)\n","Review":"HARRY POTTER \/ (2001) *** (out of four)","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"6 June 2008","Author":"Boba_Fett1138","Rating":"7","Review_Title":" A decent start of the series but also clearly one of the lesser Harry Potter movies.\n","Review":"No, I'm not a big Harry Potter fan and probably never will be but I can appreciate the qualities of the movies. Definitely for a children movie this movie is of course of very high class, with fabulous looking sets, a whole load of well known British actors and an highly experienced crew involved.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"27 January 2022","Author":"gbill-74877","Rating":"8","Review_Title":" Entertaining\n","Review":"Not a perfect story, but a lovely introduction into these characters and J. K. Rowling's magical world of wizards. Lots of great bits here, like the sorting hat, invisibility cloak, troll encounter, and quidditch match (even if the rules for this game are absurd). The casting is excellent, including the principal three (Daniel Radcliffe, Emma Watson, and Rupert Grint) and the teachers at Hogwarts (Alan Rickman, Maggie Smith, and Richard Harris). The film was a little too long and had scenes that seemed a little disconnected, leading to a rather brief, anticlimactic ending, but overall there's a reason the franchise was so popular, and this got it off the ground in good form.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"26 October 2016","Author":"ThomasDrufke","Rating":"8","Review_Title":" What a Brilliantly Fun Way to Begin a Monumental Franchise\n","Review":"If for nothing else, the Harry Potter films always find a way to give me a great sense of nostalgia. I, like many others, grew up with this franchise. In many ways, this was our generation's Star Wars. It was the 2000's pop culture phenomena. I'm happy to say that the first film, The Sorcerer's Stone, still undoubtedly holds up.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"23 June 2022","Author":"jonflottorp","Rating":"8","Review_Title":" The reason i love movies!\n","Review":"Harry Potter is a magical and fun movie.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"16 July 2014","Author":"ironhorse_iv","Rating":"7","Review_Title":" This movie set in stone, what would be the foundation of the Harry Potter film franchise. It kinda work.\n","Review":"It's seem like just yesterday, when the movie about the boy whom lived, was about to come out. People were wondering if the Harry Potter's books by J.K Rowling could easily be translated into the big screen. Harry Potter and the Philosopher's Stone AKA Sorcerer's Stone directed by Chris Columbus, indeed show that it was somewhat possible. The story follows Harry Potter (Daniel Radcliffe)'s first year at Hogwarts School of Wizardry as he discovers his gift and destiny against the dark forces of magic. The movie like the other films are cut into two plots directions. One is about student life at Hogwarts during the school-year, while the other half is about the mystery that Harry Potter must uncovered that year. It works well as a long read novel, but in movie form: its means a long sit through. The movie pacing is so long. It takes forever to get to the main plot of Harry Potter finding the Philosopher Stone. There are is a lot of filler scenes that could be cut away. I dislike how the Philosopher Stone is one-time movie McGuffin. For the best of my knowledge, the Philosopher stone plays no factor after this movie, and never mention again after this film. The third act, mostly comes out of nowhere. The twist toward the end, was pretty predictable, if you readt the books, but pretty interesting. Another thing about the movie is how non-logical the movie is. It really baffled me, how much exposition, it needed. Even an hour in the film, there were a lot of random odd things happening without much explaining. It gets more confusing as long bits of the book, like the Centaur showing in the woods, were shorten in the film. It gets worst for the centaur, as he wouldn't play a factor, in any of the later films, despite, saving Harry Potter from Voldermort. Hermione Granger (Emma Watson) was also cut short. Her riddle solving in the book was cut from the film. Several minor characters have been removed from the film version, as well. Despite those, the movie is really close to the novel. In my opinion, don't bother, trying to understand the logic of all the wizard terms, because it will take you out of the fantasy movie, and give you a headache. Still, there were some really dumb things to nitpick here like why would Professor Dumbledore (Richard Harris), even allow Harry Potter to stay with the Dursley's family when he knows that they're horrible people. Honestly, the Dursleys could had killed Harry Potter with the childhood neglect! What was he thinking? Harry Potter could had commit suicide, or gone crazy like Lord Voldermort! What an idiot! The whole movie is about children being danger all the time. I don't care if they're wizards in training, I'm surprise that the death tolls of students dying isn't as high as it should be. The school staff is questionable at times. A good example of this stupidity, is punishing students whom went out at nights, by sending them out at nights in the dark forest, where they can get attacked by creatures. The most insulting thing in logic is the black\/white one-dimensional view of good Vs evil. Honestly, how on earth is the members of Slytherin never got expulsion for all the bullies that it has? You would think, that at less, there would be one good person in Slytherin. Another thing that bugs me is the whole the power of love conquer all. I think, children are a lot smarter than the childish message, the film is trying to pull. The acting in the movie is pretty bland, for the most part. After all, most of the child actors had this film as their first roles. I wouldn't say that Harry Potter's film series, have the most entertaining of dialogues, anyways. The wooden delivery, felt like a read-through. Most of what they're saying are stating the obvious or repeating what happening on screen. It's so annoying. The other actors were master British thespians, who seem to over-act at times. A good example of this is John Hurt & Alan Rickman. It was too hammy for already over the top world. The action scenes were pretty well-done. My favorite had to be the Quidditch match and the whole chess game. I can do, without the whole troll scene. The CGI troll hasn't aged well. Visually, the movie is beautiful to look at. I love the special effects, locations & set, and costume, they did. It really made the Harry Potter world, stand out. The music by John Williams is amazing to listen to. I think director Chris Columbus was indeed the best choice for this first movie, as he got the magically part, right and how to make a family picture. You even see, how much things, he establish that other directors would reused time after time. Still, I really hope for Terry Gilliam like J.K Rowling's first choice to be the direction. The movie has great social commentary themes like the metaphor of racism, ethnic cleansing and why Nazism is bad. You can also see possible influences from other words, that made Harry Potter work. There was a few controversial moments leading up to the film, like religious debates. A few religious groups claim that Harry Potter contain occult or Satanic subtexts that isn't good for children. Another one is the use of the word, sorcerer over the word philosopher in the title. US & British have different meanings to the words, plus marketing though, it would better to call it sorcerer as that word get more appeal. Due to this different, all scenes that mention the philosopher's stone by name had to be reshot, once with the actors saying \"philosopher's\" and once with \"sorcerer's\". Overall: The movie might has its flaws, but majority, a great first watch for any fantasy fan.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"31 August 2019","Author":"JoBloTheMovieCritic","Rating":"10","Review_Title":" Harry Potter and the Sorcerer's Stone\n","Review":"10\/10 - an unforgettable start to a fantastic film series and the career of the impeccable Emma Watson (and the other kids)","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"10 November 2001","Author":"nicholas_clarke","Rating":null,"Review_Title":" As good an adaption as could ever be expected\n","Review":"To be faced with the challenge of adapting Harry Potter for the Silver screen must have been any director's nightmare- the chance of directing possibly the biggest film of this decade, but also the hardest audience-the millions of fans of the book who know every line and will pick up on every mistake. Being one of the above, I can only say that Christopher Columbus and all of the team working on HP did marvelously. The cast was brilliant (particularly notable are Alan Rickman as Snape, Maggie Smith as McGonagall, and the eerily creepy David Bradley as Argus Filch), the directing wonderful, and the scenery perfect. The only qualm is that it does not track perfectly with the book, but squeezed into 2.5 hours, this can only be expected. Well done all involved!","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"1 July 2007","Author":"Smells_Like_Cheese","Rating":"7","Review_Title":" Harry Potter and the Sorcerer's Stone\n","Review":"That's it! I give up! I surrender! White flag! My friends want to see the new Harry Potter that is about to be released this summer, The Order of Phoenix, but they looked at my like I just lost my head when I told them I never saw the Harry Potter films. They just said I've seen every movie yet I never saw Harry Potter? Well, I never saw the point since I don't read the books or wasn't interested in the films, it looked like typical kid's stuff to me. But my friends said they would not take me to see the movie until I've seen the films, it's now that I realize I got myself into trouble since these movies are all 2+ hours each. I just finished the first one a couple days ago.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"27 September 2022","Author":"jeromesgabilo","Rating":"6","Review_Title":" A GREAT START OF A FRANCHISE\n","Review":"It was amazing to watch how a huge movie franchise started with this one. It showed a basis for the entire Harry Potter timeline. The visual effects were very great for this film. It was on-point and did not feel amateurish. Unfortunately for me, everything else was a bit stale and unexciting. I was in doubt of whether it really maximized its runtime. There were, in some parts, too many scenes which the characters were doing a lot of dialogues. The production design and costumes were excellent aspects of the film, too. But for me a lot of dark cinematography was utilized, instead of a more lively kind of production.","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"},{"Review_Date":"5 March 2016","Author":"Michael_Elliott","Rating":null,"Review_Title":" Good Start to the Series\n","Review":"Harry Potter and the Sorcerer's Stone (2001) ","Review_Url":"\/review\/rw3426773\/?ref_=tt_urv"}]